Revit 2027 API
MEPAnalyticalSegment.InnerDiameter Property
 The inner diameter of this segment, in ft. For rectangular or oval profile, this may be the hydraulic diameter.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double InnerDiameter { get; }
Public ReadOnly Property InnerDiameter As Double
	Get
public:
property double InnerDiameter {
	double get ();
}
member InnerDiameter : float with get
Property Value
Double
See Also
Reference
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace